In [1]:
import pandas as pd, numpy, sqlite3

In [2]:
# Get citibike data from "https://s3.amazonaws.com/tripdata/index.html"

In [ ]:
pd.read_csv?

# Data Collection : Collect Data from url and store in database

### Create SQLite Database

In [3]:
db = sqlite3.connect("citibike.db")

### Get Data from url and store in SQLite Database

In [20]:
%%time
for i in range(1, 13):
    #url = "https://s3.amazonaws.com/tripdata/JC-2019{:02d}-citibike-tripdata.csv.zip".format(i)
    url = "https://s3.amazonaws.com/tripdata/JC-2018{:02d}-citibike-tripdata.csv.zip".format(i)
    print(url.format(i))
    chunks = pd.read_csv(url.format(i), chunksize=100_000)
    for chunk in chunks:
        chunk.columns = [column.replace(' ', '_') for column in chunk.columns]
        chunk.to_sql("tripdata", db, if_exists='append')

https://s3.amazonaws.com/tripdata/JC-201801-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201802-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201803-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201804-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201805-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201806-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201807-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201808-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201809-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201810-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201811-citibike-tripdata.csv.zip
https://s3.amazonaws.com/tripdata/JC-201812-citibike-tripdata.csv.zip
Wall time: 11min 49s

### Read data from SQLite database

In [21]:
%%time
pd.read_sql_query("select count(*) from tripdata", db)
# 943961

Wall time: 55 ms

   count(*)
0   1297853

In [23]:
%%time
df = pd.read_sql_query("select * from tripdata", db)
print(df.shape)

Wall time: 15.9 s

In [16]:
# 100_000

In [25]:
# df.info()

# Some stuff on SQLite Database

In [3]:
db = sqlite3.connect("citibike.db")

In [4]:
# cursor = db.cursor()

In [31]:
# db.commit()

In [5]:
db.execute('''
create table test1(empid int primary key, name varchar(100), age int, location varchar(50))
''')

In [8]:
db.execute("insert into test1 values(101, 'ram', 32, 'Mumbai')")
db.commit()

In [11]:
pd.read_sql_query("select * from test1", db)

   empid name  age location
0    101  ram   32   Mumbai

In [26]:
def getDataFromSQL(sql):
    row = pd.read_sql_query(sql, con=db, chunksize=100_000)
    return next(row)

In [27]:
getDataFromSQL("select count(*) from tripdata")

   count(*)
0    684505

In [18]:
# Add new columns to existing table
db.execute('''
alter table tripdata add User_Type varchar(100)
''')